[↑目次に戻る](/README.md)
<br>
# 演習2.1　SmartCSの基本動作を確認する
演習2.1では、SmartCSを介してALAXALA装置へのコンソールアクセスを行います。
<br>
TeratermなどのターミナルソフトからSmartCSへの接続時に、SmartCSの各シリアルポートに割り当てられたTCPポートを指定して
アクセスするダイレクトモードを使用します。

## 目次
本演習では以下を行います。
- STEP1. SmartCSへポートユーザでログインする
- STEP2. SmartCSを介してALAXALA装置へログインする
- STEP3. ALAXALA装置に対してコマンドを実行する
- STEP4. ALAXALA装置からログアウトする
- STEP5. SmartCSのシリアルセッションを終了する

## 演習構成図

> 後で載せる

### STEP1. SmartCSへポートユーザでログインする
SmartCSへダイレクトモードで接続し、ポートユーザでログインを行います。
<br>
まず、Teratermなどのターミナルソフトを使用して、SSHでSmartCSへ接続します。接続時に、TCPポート番号を8301と指定します。

![Teraterm_DirectMode_RW.png](Teraterm_DirectMode_RW.png)

認証に使用するポートユーザは、ログインID（port1）/パスワード（port1）です。
<br>
ログインに成功すると、以下のようなポートサーバーメニューが表示されます。
<br>

```
-- RW1 ------------------------
Host  : "NS-2250"
Label : "AX2230"
-------------------------------
1  : display Port Log
2  : display Port Log (LAST)
3  : start tty connection
4  : close telnet/ssh session
5  : show all commands
tty-1:rw>
```
> ID、Passは正式版に変更する必要有


### STEP2. SmartCSを介してALAXALA装置へログインする
ポートサーバーメニューからシリアルセッションを開始し、ALAXALA装置へログインを行います。
<br>
まず、<code>3  : start tty connection</code>を選択し、シリアルセッションを開始します。
<br>
続けてログインID（operator）を入力するとALAXALA装置にログインすることができます。
<br>

```
-- RW1 ------------------------
Host  : "NS-2250"
Label : "AX2230"
-------------------------------
1  : display Port Log
2  : display Port Log (LAST)
3  : start tty connection
4  : close telnet/ssh session
5  : show all commands
tty-1:rw> 3
Press "CTRL-Z" to return this MENU.
Start tty connection
operator

Copyright (c) 2012-2019 ALAXALA Networks Corporation. All rights reserved.

AX2230>
```



### STEP3. ALAXALA装置に対してコマンドを実行する
ALAXALA装置にログイン後、コマンドを実行します。
<br>
<code>AX2230></code>というプロンプトが表示されたら、<code>show version</code>コマンドを実行します。
<br>

```
AX2230> show version

Date 1980/04/10 03:41:23 UTC
Model: AX2230S-24T
S/W: OS-LT4 Ver. 2.10 (Build:01)
H/W: AX-2230-24T-B [CA022B24T000S0000C7S013:0]

AX2230>
```



### STEP4. ALAXALA装置からログアウトする
オペレーションが完了したら、コンソールを初期状態に戻すためにログアウトを行います。
<br>
<code>exit</code>コマンドを実行してALAXALA装置からログアウトします。
<br>

```
AX2230> exit

login: 
```



### STEP5. SmartCSのシリアルセッションを終了する
ログアウト後はSmartCSを介したシリアルセッションを終了させます。
<br>
ALAXALA装置からのログアウトが完了したら、Ctrl+Zを入力してポートサーバーメニューに戻ります。
<br>
その後、<code>4  : close telnet/ssh session</code>を選択して終了します。
<br>

```
login: 
-- RW1 ------------------------
Host  : "NS-2250"
Label : "AX2230"
-------------------------------
1  : display Port Log
2  : display Port Log (LAST)
3  : start tty connection
4  : close telnet/ssh session
5  : show all commands
tty-1:rw> 4
```



### 補足情報 セレクトモード
演習2.1ではダイレクトモードでALAXALA装置にアクセスを行いましたが、SmartCSを介したもう1つのアクセス方法としてセレクトモードがあります。
<br>
セレクトモードではSmartCSの代表ポート(SSHの場合は22)を指定してアクセスし、ポートユーザ認証を行います。

![Teraterm_SelectMode_RW.png](Teraterm_SelectMode_RW.png)

ポートユーザでログインすると、アクセス可能なシリアルポートの一覧(ポートセレクトメニュー)が表示され、ポート番号(tty)を選択してアクセスを行います。
<br>

```
Host : "NS-2250" 
login from 10.208.39.104
user (port1) Access TTY List
===========================================================================
 tty : Label                                RW     RO
---------------------------------------------------------------------------
   1 : AX2230                                0      0
   2 : AX2230_backup                         0      0
---------------------------------------------------------------------------
Enter tty number to access serial port
 <ttyno>          : connect to serial port RW session ( 1  - 48  )
 <ttyno>r         : connect to serial port RO session ( 1r - 48r )
 l                : show tty list 
 l<ttyno>-<ttyno> : show a part of tty list
 d                : show detail tty list 
 d<ttyno>-<ttyno> : show a part of detail tty list
 h                : help message 
 e                : exit 
===========================================================================
tty> 1
```

1つのシリアルポートへのオペレーションが終了したら、切替文字コードを入力することでポートサーバーメニューへ戻り、ポートセレクトメニューへ戻ることができます。
<br>
新たにターミナルを立ち上げ直すことなく、別のシリアルポートへアクセスを切り替えることが可能となります。
<br>

```
login: 
-- RW1 ------------------------
Host  : "NS-2250"
Label : "AX2230"
-------------------------------
0  : return Port Select Menu
1  : display Port Log
2  : display Port Log (LAST)
3  : start tty connection
4  : close telnet/ssh session
5  : show all commands
tty-1:rw> 0
return Port Select Menu

Host : "NS-2250" 
login from 10.208.39.104
user (port1) Access TTY List
===========================================================================
 tty : Label                                RW     RO
---------------------------------------------------------------------------
   1 : AX2230                                0      0
   2 : AX2230_backup                         0      0
---------------------------------------------------------------------------
Enter tty number to access serial port
 <ttyno>          : connect to serial port RW session ( 1  - 48  )
 <ttyno>r         : connect to serial port RO session ( 1r - 48r )
 l                : show tty list 
 l<ttyno>-<ttyno> : show a part of tty list
 d                : show detail tty list 
 d<ttyno>-<ttyno> : show a part of detail tty list
 h                : help message 
 e                : exit 
===========================================================================
tty> 2
```
